tap "deskflow/tap"
tap "homebrew/services"
tap "homeport/tap"
tap "hynek/tap"
tap "jesseduffield/lazygit"
# Library for manipulating PNG images
brew "libpng"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Download with resuming and segmented downloading
brew "aria2"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Open source IA-32 (x86) PC emulator written in C++
brew "bochs"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Handy way to save and run project-specific commands
brew "just"
# Next-gen compiler infrastructure
brew "llvm"
# Package manager for the Lua programming language
brew "luarocks"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@15", restart_service: :changed
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Rich git commit graph in your terminal
brew "serie"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# SOcket CAT: netcat on steroids
brew "socat"
# Blazingly fast terminal recorder that generates animated gif images for the web
brew "t-rec"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Yet Another Dotfiles Manager
brew "yadm"
# Information browser
cask "folo"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Replacement for Docker Desktop
cask "orbstack"
# System monitor for the menu bar
cask "stats"
